// ----------------------------------------------------------------
// let [x, y, z] = ['a', 'b', 'c', 'd', 'e']
// // 输出a b c
// console.log(x,y,z)
// ----------------------------------------------------------------
// let arr =[1,2,3,4]

// console.log(...arr)
// 输出: 1 2 3 4
// ----------------------------------------------------------------
// 通过解构给数组添加元素
// let arr = [1,2,3,4]

// console.log([0,...arr])
// ----------------------------------------------------------------
// let {name:name1,age:age} = {name:'管管',age:21}
// console.log(name1,age)

// 上述代码可省略为：（军军可以不写）
let {name="军军",age} = {name:'管管',age:21}  
console.log(name,age) // 输出 管管 21 不会打印默认值军军 