// ----------------------------------------------------------------
// 下述代码结果为undefined
// var会造成变量提升，console.log(a); var a = 1;
// 相当于 var a;  console.log(a); a = 1;
var a = 1

function foo() {
  console.log(a)
  var a = 1
}

foo()

// ----------------------------------------------------------------


// ----------------------------------------------------------------
// 下述代码会报错
// console.log(a) 运行时发生暂时性死区 局部变量和全局变量与相同名字定义时，不会区读取全局变量即便先使用后定义
// let a = 1

// function foo() {
//   console.log(a)
//   let a = 2
// }

// foo()
// ----------------------------------------------------------------
